		var a1=_("t1");
		var a2=_("t2");
		var b1=_("b1");
		var t3=_("t3");
		var t4=_("t4");
		var img =_("im2");
		var img1 =_("im1");
		var btn =_('b1');
		var myModal =_('myModal');
		var btn2 =_('b2');
		var photo1 = document.querySelectorAll("img.child-img");
		var photo2 = document.querySelectorAll("img.child-img");
		for (var k = 0; k < photo1.length; k++) {
			photo1[k];
		};
		for (var m = 0; m < photo2.length; m++) {
			photo2[m];
		};
		function _(x) {
				return document.getElementById(x);
			}
			
		//arry maps
			var a=["کابل","هرات","کندهار","پروان","کاپیسا","میدان وردک","لوگر","پنجشیر","بلخ","فاریاب","جوزجان","سمنگان","سرپل","پکتیا","پکتیکا","غزنی","خوست","ننگرهار","لغمان","کنر","فراه","غور","بادغیس","تخار","بدخشان","کندز","بغلان","هلمند","ارزگان","نیمروز","بامیان","نورستان","زابل","دایکندی"];
			var b=["کابل","هرات","کندهار","پروان","کاپیسا","میدان وردک","لوگر","پنجشیر","بلخ","فاریاب","جوزجان","سمنگان","سرپل","پکتیا","پکتیکا","غزنی","خوست","ننگرهار","لغمان","کنر","فراه","غور","بادغیس","تخار","بدخشان","کندز","بغلان","هلمند","ارزگان","نیمروز","بامیان","نورستان","زابل","دایکندی"];
			var c=[
					[0,816,497,114,102,123,78,166,444,717,566,317,608,138,200,148,230,197,147,232,907,451,833,364,377,355,221,692,470,956,181,"محاسبه نشده",1001,443],
					[816,0,572,788,892,745,868,"محاسبه نشده",708,434,617,841,476,920,975,809,1011,1008,958,1044,261,366,168,961,1171,896,922,455,730,469,677,1260,700,686],
					[496,572,0,599,592,489,466,"محاسبه نشده",1005,1003,985,802,892,438,405,350,540,688,638,724,414,703,737,849,862,820,706,198,163,462,597,"محاسبه نشده",131,489],
					[115,788,598,0,104,188,196,"محاسبه نشده",416,689,538,288,"محاسبه نشده",257,319,250,348,284,234,319,936,422,804,336,499,306,192,793,586,1051,116,"محاسبه نشده",416,462],
					[105,892,590,104,0,217,178,"محاسبه نشده",425,698,547,298,"محاسبه نشده",239,301,242,330,189,139,224,1001,256,908,345,316,202,786,563,1049,220,"محاسبه نشده",549,536],
					[123,745,489,188,218,0,175,"محاسبه نشده",517,790,639,390,"محاسبه نشده",227,208,138,318,315,265,351,893,379,761,437,536,408,335,684,404,948,109,"محاسبه نشده",358,371],
					[78,868,466,200,182,160,0,"محاسبه نشده",530,803,552,399,"محاسبه نشده",82,144,117,173,268,218,304,786,503,855,450,458,421,307,661,439,925,233,"محاسبه نشده",335,494],
					[166,"محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده",0,"محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده"],
					[445,708,928,416,425,518,526,"محاسبه نشده",0,275,124,135,"محاسبه نشده",587,649,580,678,605,555,641,967,570,562,254,465,189,344,1161,800,1175,446,"محاسبه نشده",875,593],
					[718,434,1003,689,698,790,799,"محاسبه نشده",275,0,183,407,"محاسبه نشده",860,922,805,951,878,828,913,692,649,288,527,738,462,617,886,934,900,602,"محاسبه نشده",1132,737],
					[567,617,1050,538,547,639,648,"محاسبه نشده",124,183,0,256,"محاسبه نشده",709,771,681,800,727,677,762,875,590,471,376,586,311,466,1069,819,1083,1519,"محاسبه نشده",996,613],
					[317,841,800,288,298,390,399,"محاسبه نشده",135,407,256,0,"محاسبه نشده",459,521,541,551,478,428,513,1099,624,"محاسبه نشده",230,433,433,217,996,789,1307,318,"محاسبه نشده","محاسبه نشده",665],
					["محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده",0,"محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده"],
					[139,920,457,261,243,211,82,"محاسبه نشده",591,864,713,463,"محاسبه نشده",0,92+"."+5,183,121,329,279,364,868,554,936,511,519,481,367,653,430,917,284,"محاسبه نشده",328,546],
					[201,975,405,323,305,208,144,"محاسبه نشده",653,926,775,525,"محاسبه نشده",93+","+6,0,146,175,391,341,426,816,587,968,544,581,544,429,601,393,864,317,"محاسبه نشده",275,434],
					[222,809,413,339,317,157,191,"محاسبه نشده",669,805,681,541,"محاسبه نشده",184,145,0,265,414,364,449,822,444,901,588,588,559,432,607,258,871,260,"محاسبه نشده",219,298],
					[230,1011,540,352,334,303,173,"محاسبه نشده",682,955,804,555,"محاسبه نشده",121,175,266,0,420,370,456,951,646,1030,602,611,573,459,736,513,999,376,"محاسبه نشده",411,637],
					[195,1012,692,284,189,319,269,"محاسبه نشده",605,878,727,478,"محاسبه نشده",329,391,418,421,0,97+"."+8,131,1103,647,1025,525,525,496,382,888,665,1151,400,"محاسبه نشده",558,638],
					[145,962,642,234,139,269,218,"محاسبه نشده",555,828,677,428,"محاسبه نشده",279,341,368,371,97+"."+8,0,123,1053,597,975,475,475,446,332,838,615,1101,350,"محاسبه نشده",508,588],
					[231,1047,727,319,224,354,304,"محاسبه نشده",641,913,762,513,"محاسبه نشده",364,426,453,456,131,123,0,1138,682,1060,560,560,531,417,923,700,1186,435,"محاسبه نشده",593,673],
					[907,261,414,936,1002,893,786,"محاسبه نشده",966,692,875,1099,"محاسبه نشده",869,816,840,950,1099,1049,1134,0,514,"محاسبه نشده",1219,1284,1154,1083,296,572,248,826,"محاسبه نشده","محاسبه نشده",834],
					[451,366,692,422,526,379,503,"محاسبه نشده",570,649,590,624,"محاسبه نشده",554,586,444,646,643,593,678,514,0,382,672,771,643,569,708,537,722,312,"محاسبه نشده",736,320],
					[833,168,737,804,908,761,855,"محاسبه نشده",562,288,471,"محاسبه نشده","محاسبه نشده",936,968,901,1030,1025,975,1060,"محاسبه نشده",382,0,815,1025,750,905,620,895,634,694,"محاسبه نشده",865,702],
					[373,961,925,336,345,437,446,"محاسبه نشده",254,527,376,231,"محاسبه نشده",507,644,588,598,525,475,560,1219,672,815,0,221,66,264,1121,836,1384,366,"محاسبه نشده",794,712],
					[381,1171,861,349,345,536,454,"محاسبه نشده",465,737,586,433,"محاسبه نشده",515,577,586,607,525,475,560,1285,771,1025,221,0,277,291,1056,834,1320,465,"محاسبه نشده",732,811],
					[337,896,820,308,317,409,418,"محاسبه نشده",189,462,311,433,"محاسبه نشده",470,541,560,570,497,447,532,1154,644,750,66,277,0,236,1015,808,338,"محاسبه نشده",765,684],
					[257,935,704,192,221,335,330,"محاسبه نشده",334,617,466,217,"محاسبه نشده",391,453,486,483,401,351,436,1083,569,905,264,291,235,0,900,733,1164,263,"محاسبه نشده",575,609],
					[692,455,199,795,787,684,661,"محاسبه نشده",1160,886,1069,1073,"محاسبه نشده",654,601,625,735,884,834,919,296,708,1056,1121,1058,1091,901,0,357,229,793,"محاسبه نشده",327,683],
					[487,163,731,604,583,422,457,"محاسبه نشده",810,953,830,807,"محاسبه نشده",450,411,276,531,680,630,715,572,547,895,854,853,825,751,357,0,620,526,"محاسبه نشده",283,334],
					[956,469,462,1058,1051,948,925,"محاسبه نشده",1174,900,1083,1307,"محاسبه نشده",918,864,889,999,1148,1098,1183,251,722,634,1384,1321,1355,1165,229,620,0,1056,"محاسبه نشده",590,947],
					[181,677,597,116,220,109,233,"محاسبه نشده",446,601,567,318,"محاسبه نشده",284,316,260,376,400,350,435,826,312,694,365,465,336,263,793,508,1056,0,"محاسبه نشده",466,352],
					["محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده","محاسبه نشده",0,"محاسبه نشده","محاسبه نشده","محاسبه نشده"],
					[366,701,131,469,461,358,335,"محاسبه نشده",875,1132,996,"محاسبه نشده","محاسبه نشده",328,275,219,411,558,508,593,"محاسبه نشده",736,865,794,732,765,575,327,283,590,466,"محاسبه نشده",0,472],
					[442,686,489,462,566,371,494,"محاسبه نشده",593,736,613,665,"محاسبه نشده",546,433,298,637,634,584,670,834,320,702,712,811,683,609,683,334,497,352,"محاسبه نشده",472,0]
				];
				var pr1=["img/کابل.gif","img/هرات.gif","img/کندهار.gif","img/پروان.gif","img/کاپیسا.gif","img/وردک.gif","img/لوگر.gif","img/پنجشیر.gif","img/بلخ.gif","img/فاریاب.gif","img/جوزجان.gif","img/سمنگان.gif","img/سرپل.gif","img/پکتیا.gif","img/پکتیکا.gif","img/غزنی.gif","img/خوست.gif","img/ننگرهار.gif","img/لغمان.gif","img/کنر.gif","img/فراه.gif","img/غور.gif","img/بادغیس.gif","img/تخار.gif","img/بدخشان.gif","img/کندز.gif","img/بغلان.gif","img/هلمند.gif","img/ارزگان.gif","img/نیمروز.gif","img/بامیان.gif","img/نورستان.gif","img/زابل.gif","img/دایکندی.gif"];
				var pr=["img/کابل.gif","img/هرات.gif","img/کندهار.gif","img/پروان.gif","img/کاپیسا.gif","img/وردک.gif","img/لوگر.gif","img/پنجشیر.gif","img/بلخ.gif","img/فاریاب.gif","img/جوزجان.gif","img/سمنگان.gif","img/سرپل.gif","img/پکتیا.gif","img/پکتیکا.gif","img/غزنی.gif","img/خوست.gif","img/ننگرهار.gif","img/لغمان.gif","img/کنر.gif","img/فراه.gif","img/غور.gif","img/بادغیس.gif","img/تخار.gif","img/بدخشان.gif","img/کندز.gif","img/بغلان.gif","img/هلمند.gif","img/ارزگان.gif","img/نیمروز.gif","img/بامیان.gif","img/نورستان.gif","img/زابل.gif","img/دایکندی.gif"];
				var  text=_('text');
				var t5 =_('t5');
				function mytime(){
				for(var i=0; i<a.length; i++){
					for(var j=0; j< b.length; j++){
						if((a1.value == a[i] && a2.value == b[j]) || (a2.value == a[i] && a1.value == b[j]) ){
						var distance = c[i][j];
						distance = distance * 1000;
						var v = +(text.value);
						var zaman= distance/v;
						var hour =  parseInt(zaman/3600);

						var min =parseInt((zaman%3600)/60);
						var scecond =parseInt(zaman%60);
						if(scecond<=9){
							scecond = "0"+scecond;
						}
						if(min<=9){
							min = "0"+min;
						}
						if(hour<=9){
							hour = "0"+hour;
						}
						t5.innerHTML= hour+":"+min+":"+scecond;
					}}}};
		function w(){
				for(var i=0; i<a.length; i++){
					for(var j=0; j< b.length; j++){
						if((a1.value == a[i] && a2.value == b[j]) || (a2.value == a[i] && a1.value == b[j]) ){
						t3.innerHTML=c[i][j]+"KM";
						if(c[i][j]=="محاسبه نشده"){
							t4.innerHTML=c[i][j];
						}
						else{
							t4.innerHTML=c[i][j]+"KM"+":فاصله";
						}
						
						btn2.style.display="block";
						img.src=pr[i];
						img1.src=pr1[j];
						photo1[j].src= pr[i];
						var id1 = photo1[j].id;
						var id2 = photo2[j].id;
						photo2[j].src=pr1[j];
						if(id1 == "Kabul" || id2== "Kabul"){
							_("Kabul").style.width="41.5px";
							_("Kabul").style.height="35px";
							_("Kabul").style.left="250px";
							_("Kabul").style.top="109px";	
						}
						else if(id1 == "Herat" || id2== "Herat"){
							_("Herat").style.width="129px";
							_("Herat").style.height="98px";
							_("Herat").style.left="22px";
							_("Herat").style.top="85px";
						}
						else if (id1 == "Kandahar" || id2 == "Kandahar") {
							_("Kandahar").style.height="121px";
							_("Kandahar").style.top="178px";
							_("Kandahar").style.width="125px";
						}
						else if(id1 == "Parwan" || id2 == "Parwan"){
							_("Parwan").style.width="51px";
							_("Parwan").style.height="42.5px";
							_("Parwan").style.left="238px";
							_("Parwan").style.top="90px";
						}
						else if(id1 == "Kapisa" || id2 == "Kapisa"){
							_("Kapisa").style.left="264px";
							_("Kapisa").style.top="102px";

						}
						else if(id1 == "MaidanWardak" || id2 == "MaidanWardak"){
							_("MaidanWardak").style.height="50.8px";
							_("MaidanWardak").style.left="216px";
							_("MaidanWardak").style.top="110px";
							_("MaidanWardak").style.width="52px";
						}
						else if(id1 == "Logar" || id2 == "Logar"){
							_("Logar").style.width="43px";
							_("Logar").style.height="29px";
							_("Logar").style.top="129px";
							_("Logar").style.left="249px";
						}
						else if(id1 == "Panjshir" || id2 == "Panjshir"){
							_("Panjshir").style.height="37px";
							_("Panjshir").style.width="38.5px";
							_("Panjshir").style.left="263.3px";
						}
						else if(id1 == "Balkh" || id2 == "Balkh"){
							_("Balkh").style.width="61px";
							_("Balkh").style.left="189px";
						}
						else if(id1 == "Faryab" || id2 == "Faryab"){
							_("Faryab").style.height="62px";
							_("Faryab").style.width="80px";
							_("Faryab").style.top="43px";
							_("Faryab").style.left="116px";

						}
						else if(id1 == "Jowzjan" || id2 == "Jowzjan"){
							_("Jowzjan").style.width="83px";
							_("Jowzjan").style.height="72px";
							_("Jowzjan").style.left="142.8px";
							_("Jowzjan").style.top="27px";
						}
						else if(id1 == "Samangan" || id2 == "Samangan"){
							_("Samangan").style.width="50px";
							_("Samangan").style.height="50px";
							_("Samangan").style.left="204px";

						}
						else if(id1 == "Sar-ePol" || id2 == "Sar-ePol"){
							_("Sar-ePol").style.width="56px";
							_("Sar-ePol").style.height="53px";
							_("Sar-ePol").style.left="165px";
							_("Sar-ePol").style.top="64px";
						}
						else if(id1 == "Paktia" || id2 == "Paktia"){
							_("Paktia").style.width="58px";
							_("Paktia").style.left="246px";
							_("Paktia").style.top="125px";
							_("Paktia").style.height="55px";
						}
						else if(id1 == "Paktika" || id2 == "Paktika"){
							_("Paktika").style.width="53.5px";
							_("Paktika").style.height="57px";
							_("Paktika").style.left="230px";
							_("Paktika").style.top="159px";

						}
						else if(id1 == "Ghazni" || id2 == "Ghazni"){
							_("Ghazni").style.width="56px";
							_("Ghazni").style.height="87px";
							_("Ghazni").style.top="128px";
						}
						else if(id1 == "Khost" || id2 == "Khost"){
							_("Khost").style.height="28px";
							_("Khost").style.top="146px";
						}
						else if(id1 == "Nangarhar" || id2 == "Nangarhar"){
							_("Nangarhar").style.width="60px";
							_("Nangarhar").style.top="117px";
							_("Nangarhar").style.height="30px";
							_("Nangarhar").style.left="268px";
						}
						else if(id1 == "Laghman" || id2 == "Laghman"){
							_("Laghman").style.height="25px";
							_("Laghman").style.top="106px";

						}
						else if(id1 == "Kunar" || id2 == "Kunar"){
							_("Kunar").style.width="40px";
							_("Kunar").style.left="294px";
							_("Kunar").style.height="38px";
							_("Kunar").style.top="95.8px";

						}
						else if(id1 == "Farah" || id2 == "Farah"){
							_("Farah").style.width="125px";
							_("Farah").style.top="139px";
							_("Farah").style.left="32px";
							_("Farah").style.height="90px";
						}
						else if(id1 == "Ghor" || id2 == "Ghor"){
							_("Ghor").style.width="128px";
							_("Ghor").style.left="88px";
							_("Ghor").style.top="98px";
							_("Ghor").style.height="78px";
						}
						else if(id1 == "Badghis" || id2 == "Badghis"){
							_("Badghis").style.width="70.8px";
							_("Badghis").style.left="92px";
							_("Badghis").style.height="64px";
							_("Badghis").style.top="76px";
						}
						else if(id1 == "Takhar" || id2 == "Takhar"){
							_("Takhar").style.width="63.5px";
							_("Takhar").style.left="252.5px";
						}
						else if(id1 == "Badakhshan" || id2 == "Badakhshan"){
							_("Badakhshan").style.top="3.5px";
							_("Badakhshan").style.height="101px";
							_("Badakhshan").style.left="285px";
						}
						else if(id1 == "Kunduz" || id2 == "Kunduz"){
							_("Kunduz").style.width="44px";
							_("Kunduz").style.height="37px";
							_("Kunduz").style.top="42px";

						}
						else if(id1 == "Baghlan" || id2 == "Baghlan"){
							_("Baghlan").style.width="56px";
							_("Baghlan").style.height="50px";
							_("Baghlan").style.top="66px";
							_("Baghlan").style.left="235px";

						}
						else if(id1 == "Helmand" || id2 == "Helmand"){
							_("Helmand").style.width="170.5px";
							_("Helmand").style.left="41px";
							_("Helmand").style.top="149.5px";
							_("Helmand").style.height="158.5px";
						}
						else if(id1 == "Urozgan" || id2 == "Urozgan"){
							_("Urozgan").style.width="60px";
							_("Urozgan").style.top="158px";
							_("Urozgan").style.height="46px";
						}
						else if(id1 == "Nimruz" || id2 == "Nimruz"){
							_("Nimruz").style.height="110px";
							_("Nimruz").style.width="101px";
							_("Nimruz").style.left="34.5px";
							_("Nimruz").style.top="189px";
						}
						else if(id1 == "Bamyan" || id2 == "Bamyan"){
							_("Bamyan").style.width="51px";
							_("Bamyan").style.top="96px";
							_("Bamyan").style.height="53px";
						}
						else if(id1 == "Nuristan" || id2 == "Nuristan"){
							_("Nuristan").style.width="47px";
							_("Nuristan").style.top="78px";
							_("Nuristan").style.height="48px";
							_("Nuristan").style.left="282px";
						}
						else if(id1 == "Zabul" || id2 == "Zabul"){
							_("Zabul").style.width="58px";
							_("Zabul").style.top="169px";
							_("Zabul").style.height="68px";
						}
						else if(id1 == "Daykundi" || id2 == "Daykundi"){
							_("Daykundi").style.width="53.5px";
							_("Daykundi").style.top="121.5px";
							_("Daykundi").style.left="169px";
							_("Daykundi").style.height="54px";
						}	
				}}}};
				function btnInfo() {
					myModal.style.display="block";
				}
				function backmodal() {
				myModal.style.display="none";
			}
			function closewindow(){
				window.close();

			}